import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class DataService {
  depthPlate = [0.4, 0.45, 0.5, 0.55, 0.6, 0.65, 0.7, 0.75, 0.8, 0.9, 1, 1.1, 1.2, 1.5, 2, 2.5];
  I_BeamChannel = [100,110,120,130,140,150,160,170,180,200,230,250,260,290,300,340,350,390,400,440,450,492,496,543,547,593,691,697,791,798,893,900,990,998,1006,1013];
  squareTube = [10,15,20,25,30,35,40,42,45,50,60,70,80,90,100,110,120,140,150,160];
  cornerShelf = [25,28,30,32,35,40,45,50,56,63,70,75,80,90,100,110,125,140,160,180,200,220,250];
  materialExecution = [{name:'Оцинкованная сталь',val:0},{name:'Нержавеющая сталь 304',val:1},{name:'Нержавеющая сталь 316',val:2},{name:'Горячее цинкование',val:3}];
  typePipeline = [
    {name:'Труба ГОСТ 1060-83, DIN 2448',val:0},
    {name:'Труба ГОСТ 3262-83, DIN 2440',val:1},
    {name:'Сточная труба, чугун, SML',val:2},
    {name:'Труба ПВХ, DIN 8062',val:3},
    {name:'Труба PE/PP',val:4},
    {name:'Сточная труба, GA, DIN 19500',val:4},
    ];
  constructor() { }
}
